/**
 *   Next attempt at a rubik solver.  Like the previous, this does it
 *   based on solving each individual face.
 */
#define HALFTURN
#ifdef HALFTURN
#define NMOVES (18)
#define TWISTS (3)
#define DEPTH (10)
#else
#define NMOVES (12)
#define TWISTS (2)
#define DEPTH (11)
#endif
#define FACES (6)
#define M (48)
#define SYMMETRY (8)
#define POSITIONS (6)
#define MAXMOVES (40)
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
int doall = 0 ;
/**
 *   Error.
 */
void error(char *s) {
   fprintf(stderr, "Error: %s\n", s) ;
   exit(10) ;
}
struct symfast {
   unsigned char c[8] ;
   int ss, charoff ;
   unsigned char *p ;
} ;
/**
 *   The number of states for four-edge and four-corner.
 */
#define EDGE4_SIZE (190080)
#define CORNER4_SIZE (136080)
#define CSIZE (16*81*8*7*6*5/5)
int topn, symp ;
int downcounter ;
struct symfast *symptr ;
int primaryseen ;
int symmseen ;
double left ;
double plus ;
double evaled = 0.0 ;
double lur = 0.0 ;
int bestval ;
long oldtime ;
int parity = 0 ;
int pwr[5] = {1, 3, 9, 27, 81} ; // 20
int heap[POSITIONS] ; // 24
struct symfast protosymfast ; // 28
unsigned char movehist[MAXMOVES] ; // 40
unsigned char solution[MAXMOVES] ; // 40
unsigned char top[M] ; // 48
double rube[20] ; // 160
unsigned char fmap[M][FACES] ; // 288
unsigned char map[M][NMOVES] ; // 864
unsigned short val3[256] ; // 1024
unsigned char primary[12*12*12*12] ;
unsigned char *memp[12*12*12*12] ;
struct symfast symfast[MAXMOVES][POSITIONS] ; // 6720
unsigned char symmetrical[12*12*12*12] ;
char filename[100] ;
unsigned char *edge4_dist ;
unsigned char *corner4_dist ;
/**
 *   These are the twist permutations for edges, labeling the
 *   edges
 *
 *      0      4   5     8
 *    1   2            9   10
 *      3      6   7     11
 *     UP       MID     DOWN
 *
 *   We only give the + twists.  The others we figure by repeated
 *   application.
 *
 *   Twists are in the order UFRDBL.
 */
char edge_twist_perm[FACES][4] = {
   { 0, 2, 3, 1 },
   { 3, 7, 11, 6 },
   { 2, 5, 10, 7 },
   { 9, 11, 10, 8 },
   { 0, 4, 8, 5 },
   { 1, 6, 9, 4 }
} ;
/**
 *   These are the twist permutations for the corners, labeling the
 *   corners
 *
 *     0   1       4   5
 *     2   3       6   7
 *      UP          DOWN
 */
char corner_twist_perm[FACES][4] = {
   { 0, 1, 3, 2 },
   { 2, 3, 7, 6 },
   { 3, 1, 5, 7 },
   { 4, 6, 7, 5 },
   { 1, 0, 4, 5 },
   { 0, 2, 6, 4 }
} ;
/**
